inf265/template-cmake-arduino-controllino/libraries/CONTROLLINO_Library/Boards/avr/variants/Controllino_maxi_automation/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA

  $Id: wiring.h 249 2007-02-03 16:52:51Z mellis $
*/

#include "../mega/pins_arduino.h"
#undef NUM_DIGITAL_PINS
#define NUM_DIGITAL_PINS            75
#undef NUM_ANALOG_INPUTS
#define NUM_ANALOG_INPUTS           16
#define CONTROLLINO_MAXI_AUTOMATION

#define PIN_SPI_SS_ETHERNET_LIB     70 

